---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.WireType
source: html/0126218a-1957-221c-0fd1-b73891d8ccee.htm
---
# WireType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.